sobczyk/bsp/csps/lpc32xx/source/lpc32xx_mlcnand_driver.c
/***********************************************************************
 * $Id:: lpc32xx_mlcnand_driver.c 1024 2008-08-06 22:24:29Z wellsk     $
 *
 * Project: LPC3xxx MLC NAND controller driver
 *
 * Description:
 *     This file contains driver support for the LPC3xxx MLC NAND
 *     controller.
 *
 ***********************************************************************
 * Software that is described herein is for illustrative purposes only
 * which provides customers with programming information regarding the
 * products. This software is supplied "AS IS" without any warranties.
 * NXP Semiconductors assumes no responsibility or liability for the
 * use of the software, conveys no license or title under any patent,
 * copyright, or mask work right to the product. NXP Semiconductors
 * reserves the right to make changes in the software without
 * notification. NXP Semiconductors also make no representation or
 * warranty that such application will be suitable for the specified
 * use without further testing or modification.
 *********************************************************************/

#include "lpc32xx_clkpwr_driver.h"
#include "lpc32xx_dma_driver.h"
#include "lpc32xx_intc_driver.h"
#include "lpc_nandflash_params.h"
#include "lpc32xx_mlcnand_driver.h"

/***********************************************************************
 * MLC NAND controller driver package data
***********************************************************************/

/* MLC NAND controller device configuration structure type */
typedef struct
{
  BOOL_32 init;           /* Device initialized flag */
  MLCNAND_REGS_T *regptr; /* Pointer to MLC NAND registers */
  NANDFLASH_PARAM_T *paramptr; /* Pointer to NAND flash parameters */
} MLCNAND_CFG_T;

/* MLC NAND controller driver data */
static MLCNAND_CFG_T mlcdat;

/* device handle */
static INT_32 dmach;

/* DMA list */
static DMAC_LL_T *dmalist;

/* Pointer to DMA registers */
static DMAC_REGS_T *pdmaregs;

/* completion of DMA */
static BOOL_32 dma_completion;

/* Number of DMA channels */
#define DMA_MAX_CHANNELS 8

/***********************************************************************
 * SDcard controller driver private functions
 **********************************************************************/

/***********************************************************************
 *
 * Function: mlcnand_dma_interrupt
 *
 * Purpose: DMA controller interrupt handler
 *
 * Processing:
 *     See function.
 *
 * Parameters: None
 *
 * Outputs: None
 *
 * Returns: None
 *
 * Notes: None
 *
 **********************************************************************/
void mlcnand_dma_interrupt(void)
{
  INT_32 ch;

  pdmaregs = dma_get_base();

  /* Check all pending interrupt statuses */
  ch = 0;
  while (ch < DMA_MAX_CHANNELS)
  {
    /* Check channel interrupt status */
    if ((pdmaregs->int_stat & _BIT(ch)) != 0)
    {
      /* Check channel terminal count interrupt status */
      if ((pdmaregs->int_tc_stat & _BIT(ch)) != 0)
      {
        pdmaregs->int_tc_clear = _BIT(ch);

        /* Select MLC NAND controller, 
                    disable DMA_REQ signal on NAND_RnB,
                    disable DMA_REQ signal on NAND_INT */
        clkpwr_setup_nand_ctrlr(0, 0, 0);

        dma_completion = TRUE;
      }

      /* Check channel error interrupt status */
      if ((pdmaregs->int_err_stat & _BIT(ch)) != 0)
      {
        pdmaregs->int_err_clear = _BIT(ch);
      }
    }
    /* Next channel */
    ch++;
  }
}

/***********************************************************************
 *
 * Function: mlcnand_interrupt
 *
 * Purpose: MLC NAND controller interrupt handler
 *
 * Processing:
 *     See function.
 *
 * Parameters: None
 *
 * Outputs: None
 *
 * Returns: None
 *
 * Notes: None
 *
 **********************************************************************/
void mlcnand_interrupt(void)
{
  /* Clear Interrupt Status */
  while ((mlcdat.regptr->mlc_irq_sr & (MLC_INT_DEV_RDY |
                                       MLC_INT_CNTRLLR_RDY | MLC_INT_DECODE_FAIL |
                                       MLC_INT_DECODE_ERR | MLC_INT_ENCDEC_RDY |
                                       MLC_INT_SWWP_FAULT)));
}

/***********************************************************************
 *
 * Function: mlcnand_dma_read
 *
 * Purpose: Setup DMA channel for dma read from mlc
 *
 * Processing:
 *     Transfer data from mlc to memory
 *
 * Parameters:
 *     devid: Pointer to MLC NAND controller config structure
 *     dmasrc: DMA src address
 *     dmadest: DMA dest address
 *
 * Outputs: None
 *
 * Returns: The status of DMA channel setup for dma read from mlc
 *
 * Notes: None
 *
 **********************************************************************/
STATUS mlcnand_dma_read(INT_32 devid, UNS_32 dmasrc, UNS_32 dmadest,
                        DMAC_LL_T *dma)
{
  STATUS status = _NO_ERROR;

  dma_completion = FALSE;

  dmalist = dma;

  dmalist[0].dma_src = dmasrc;
  dmalist[0].dma_dest = (UNS_32)dmadest;
  dmalist[0].next_lli = 0;
  dmalist[0].next_ctrl = ((SMALL_BLOCK_PAGE_SIZE / 4) |
                    DMAC_CHAN_SRC_BURST_1 |
                    DMAC_CHAN_DEST_BURST_1 |
                    DMAC_CHAN_SRC_WIDTH_32 |
                    DMAC_CHAN_DEST_WIDTH_32 |
                    DMAC_CHAN_DEST_AHB1 |
                    DMAC_CHAN_DEST_AUTOINC |
                    DMAC_CHAN_INT_TC_EN);

  /* Get a DMA channel */
  dmach = dma_alloc_channel(-1, (PFV) mlcnand_dma_interrupt);
  if (dmach < 0)
  {
    return _ERROR;
  }

  /* setup DMA channel */
  pdmaregs = dma_get_base();
  pdmaregs->int_tc_clear = _BIT(dmach);
  pdmaregs->int_err_clear = _BIT(dmach);
  pdmaregs->dma_chan[dmach].src_addr = dmalist[0].dma_src;
  pdmaregs->dma_chan[dmach].dest_addr = dmalist[0].dma_dest;
  pdmaregs->dma_chan[dmach].lli = (UNS_32)dmalist[0].next_lli;
  pdmaregs->dma_chan[dmach].control = dmalist[0].next_ctrl;
  pdmaregs->dma_chan[dmach].config_ch = DMAC_CHAN_ITC |
                    DMAC_CHAN_IE |
                    DMAC_CHAN_FLOW_D_P2M |
                    DMAC_DEST_PERIP(0) |
                    DMAC_SRC_PERIP(DMA_PERID_NAND2) |
                    DMAC_CHAN_ENABLE;

