sobczyk/bsp/csps/lpc32xx/source/lpc32xx_mlcnand_driver.c
  return status;
}

/***********************************************************************
 *
 * Function: mlcnand_dma_write
 *
 * Purpose: Setup DMA channel for dma write to mlc
 *
 * Processing:
 *     Transfer data from memory to mlc
 *
 * Parameters:
 *     devid: Pointer to MLC NAND controller config structure
 *     dmasrc: DMA src address
 *     dmadest: DMA dest address
 *
 * Outputs: None
 *
 * Returns: The status of DMA channel setup for dma write to mlc
 *
 * Notes: None
 *
 **********************************************************************/
STATUS mlcnand_dma_write(INT_32 devid, UNS_32 dmasrc, UNS_32 dmadest,
                         DMAC_LL_T *dma)
{
  STATUS status = _NO_ERROR;

  dma_completion = FALSE;

  dmalist = dma;

  dmalist[0].dma_src = (UNS_32)dmasrc;
  dmalist[0].dma_dest = dmadest;
  dmalist[0].next_lli = (UNS_32) & dmalist[1];
  dmalist[0].next_ctrl = ((SMALL_BLOCK_PAGE_MAIN_AREA_SIZE / 4) |
                    DMAC_CHAN_SRC_BURST_1 |
                    DMAC_CHAN_DEST_BURST_1 |
                    DMAC_CHAN_SRC_WIDTH_32 |
                    DMAC_CHAN_DEST_WIDTH_32 |
                    DMAC_CHAN_DEST_AHB1 |
                    DMAC_CHAN_SRC_AUTOINC |
                    DMAC_CHAN_INT_TC_EN);

  dmalist[1].dma_src = (UNS_32)(dmasrc +
                    SMALL_BLOCK_PAGE_MAIN_AREA_SIZE);
  dmalist[1].dma_dest = dmadest;
  dmalist[1].next_lli = (UNS_32) & dmalist[2];
  dmalist[1].next_ctrl = (1 |
                    DMAC_CHAN_SRC_BURST_1 |
                    DMAC_CHAN_DEST_BURST_1 |
                    DMAC_CHAN_SRC_WIDTH_32 |
                    DMAC_CHAN_DEST_WIDTH_32 |
                    DMAC_CHAN_DEST_AHB1 |
                    DMAC_CHAN_SRC_AUTOINC |
                    DMAC_CHAN_INT_TC_EN);

  dmalist[2].dma_src = (UNS_32)(dmasrc +
                    SMALL_BLOCK_PAGE_MAIN_AREA_SIZE + 4);
  dmalist[2].dma_dest = dmadest;
  dmalist[2].next_lli = 0;
  dmalist[2].next_ctrl = (1 |
                    DMAC_CHAN_SRC_BURST_1 |
                    DMAC_CHAN_DEST_BURST_1 |
                    DMAC_CHAN_SRC_WIDTH_16 |
                    DMAC_CHAN_DEST_WIDTH_16 |
                    DMAC_CHAN_DEST_AHB1 |
                    DMAC_CHAN_SRC_AUTOINC |
                    DMAC_CHAN_INT_TC_EN);

  /* Get a DMA channel */
  dmach = dma_alloc_channel(-1, (PFV) mlcnand_dma_interrupt);
  if (dmach < 0)
  {
    return _ERROR;
  }

  /* setup DMA channel */
  pdmaregs = dma_get_base();
  pdmaregs->int_tc_clear = _BIT(dmach);
  pdmaregs->int_err_clear = _BIT(dmach);
  pdmaregs->dma_chan[dmach].src_addr = dmalist[0].dma_src;
  pdmaregs->dma_chan[dmach].dest_addr = dmalist[0].dma_dest;
  pdmaregs->dma_chan[dmach].lli = (UNS_32)dmalist[0].next_lli;
  pdmaregs->dma_chan[dmach].control = dmalist[0].next_ctrl;
  pdmaregs->dma_chan[dmach].config_ch = DMAC_CHAN_ITC |
                    DMAC_CHAN_IE |
                    DMAC_CHAN_FLOW_D_M2M |
                    DMAC_DEST_PERIP(0) |
                    DMAC_SRC_PERIP(0) |
                    DMAC_CHAN_ENABLE;

  return status;
}

/***********************************************************************
 *
 * Function: mlcnand_read_id
 *
 * Purpose: Read MLC NAND flash id
 *
 * Processing:
 *     If init is not TRUE, then return _ERROR as mlc was not
 *     previously opened. Otherwise, read MLC NAND flash id.
 *
 * Parameters:
 *     devid: Pointer to MLC NAND controller config structure
 *     buf:   Pointer to data buffer to copy to
 *
 * Outputs: None
 *
 * Returns: The status of read id operation
 *
 * Notes: None
 *
 **********************************************************************/
STATUS mlcnand_read_id(INT_32 devid, void *buf)
{
  STATUS status = _ERROR;
  UNS_32 *dwptr = buf;
  int idx;

  if (mlcdat.init == TRUE)
  {
    status = _NO_ERROR;

    /* ID read (1) command */
    mlcdat.regptr->mlc_cmd = NAND_CMD_READID;

    /* Column Address */
    mlcdat.regptr->mlc_addr = 0;

    /* Wait for MLC NAND ready */
    while (!(mlcdat.regptr->mlc_isr & MLC_DEV_RDY_STS));

    /* Read ID_SIZE/4 words from MLC NAND flash data register */
    for (idx = 0; idx < (ID_SIZE / 4); idx++)
    {
      *dwptr = (UNS_32)mlcdat.regptr->mlc_data[0];
    }
  }

  return status;
}

/***********************************************************************
 *
 * Function: mlcnand_erase_block
 *
 * Purpose: Erase MLC NAND flash block
 *
 * Processing:
 *     If init is not TRUE, then return _ERROR as mlc was not
 *     previously opened. Otherwise, erase MLC NAND flash block.
 *
 * Parameters:
 *     devid: Pointer to MLC NAND controller config structure
 *     block_num: Block to be erased
 *
 * Outputs: None
 *
 * Returns: The status of block erase operation
 *
 * Notes: None
 *
 **********************************************************************/
STATUS mlcnand_erase_block(INT_32 devid, UNS_32 block_num)
{
  STATUS status = _ERROR;

  if (mlcdat.init == TRUE)
  {
    status = _NO_ERROR;

    if (mlcdat.paramptr->block_page == BLOCK_PAGE_SMALL)
    {
      /* Wait for MLC NAND ready */
      while (!(mlcdat.regptr->mlc_isr & MLC_DEV_RDY_STS));

      /* Auto block erase 1-st command */
      mlcdat.regptr->mlc_cmd = NAND_CMD_ERASE1ST;

      /* Page Address 1st */
      mlcdat.regptr->mlc_addr = ((block_num << 5) & 0xE0);

      /* Page Address 2nd */
      mlcdat.regptr->mlc_addr = ((block_num << 5) >> 8) &
                    _BITMASK(8);

      if (mlcdat.paramptr->addr_cycles == ADDR_CYCLES_4)
      {
        /* Page Address 3rd */
        mlcdat.regptr->mlc_addr = ((block_num << 5) >> 16) &
                    _BITMASK(8);
      }

      /* Auto block erase 2-nd command */
      mlcdat.regptr->mlc_cmd = NAND_CMD_ERASE2ND;

      /* Wait for MLC NAND ready */
      while (!(mlcdat.regptr->mlc_isr & MLC_DEV_RDY_STS));

      /* Status read (1) command */
      mlcdat.regptr->mlc_cmd = NAND_CMD_STATUS;

      /* Operation status */
      if (mlcdat.regptr->mlc_data[0] & NAND_FLASH_FAILED)
      {
        status = _ERROR;
      }
    }
    else if (mlcdat.paramptr->block_page == BLOCK_PAGE_LARGE)
    {
      /* Wait for MLC NAND ready */
      while (!(mlcdat.regptr->mlc_isr & MLC_DEV_RDY_STS));

      /* Auto block erase 1-st command */
      mlcdat.regptr->mlc_cmd = NAND_CMD_ERASE1ST;

      /* Page Address 1st */
      mlcdat.regptr->mlc_addr = ((block_num << 6) & 0xC0);

