sobczyk/bsp/csps/lpc32xx/source/lpc32xx_mlcnand_driver.c
      /* Page Address 2nd */
      mlcdat.regptr->mlc_addr = ((block_num << 6) >> 8) &
                    _BITMASK(8);

      if (mlcdat.paramptr->addr_cycles == ADDR_CYCLES_5)
      {
        /* Page Address 3rd */
        mlcdat.regptr->mlc_addr = ((block_num << 6) >> 16) &
                    _BITMASK(8);
      }

      /* Auto block erase 2-nd command */
      mlcdat.regptr->mlc_cmd = NAND_CMD_ERASE2ND;

      /* Wait for MLC NAND ready */
      while (!(mlcdat.regptr->mlc_isr & MLC_DEV_RDY_STS));

      /* Status read (1) command */
      mlcdat.regptr->mlc_cmd = NAND_CMD_STATUS;

      /* Operation status */
      if (mlcdat.regptr->mlc_data[0] & NAND_FLASH_FAILED)
      {
        status = _ERROR;
      }
    }
  }

  return status;
}

/***********************************************************************
 *
 * Function: mlcnand_read_spare
 *
 * Purpose: Read MLC NAND flash page spare area
 *
 * Processing:
 *     If init is not TRUE, then return _ERROR as mlc was not
 *     previously opened. Otherwise, read MLC NAND flash page spare
 *     area.
 *
 * Parameters:
 *     devid: Pointer to MLC NAND controller config structure
 *     blockpage: Pointer to MLC_BLOCKPAGE_T structure
 *
 * Outputs: None
 *
 * Returns: The status of read spare operation
 *
 * Notes:
 *     Small page -
 *      ------------------------------------------
 *     |    512 bytes main   |   16 bytes spare   |
 *      ------------------------------------------
 *     Large page -
 *      ------------------------------------------
 *     |    512 bytes main   |   16 bytes spare   |
 *      ------------------------------------------
 *      ------------------------------------------
 *     |    512 bytes main   |   16 bytes spare   |
 *      ------------------------------------------
 *      ------------------------------------------
 *     |    512 bytes main   |   16 bytes spare   |
 *      ------------------------------------------
 *      ------------------------------------------
 *     |    512 bytes main   |   16 bytes spare   |
 *      ------------------------------------------
 *
 **********************************************************************/
STATUS mlcnand_read_spare(INT_32 devid, MLC_BLOCKPAGE_T *blockpage)
{
  STATUS status = _ERROR;
  UNS_32 *dwptr = (UNS_32 *)blockpage->buffer;
  int idx, idy;

  if (mlcdat.init == TRUE)
  {
    status = _NO_ERROR;

    if (mlcdat.paramptr->block_page == BLOCK_PAGE_SMALL)
    {
      /* Wait for MLC NAND ready */
      while (!(mlcdat.regptr->mlc_isr & MLC_DEV_RDY_STS));

      /* Read mode (3) command */
      mlcdat.regptr->mlc_cmd = NAND_CMD_READ3;

      /* Column Address */
      mlcdat.regptr->mlc_addr = 0;

      /* Page Address 1st */
      mlcdat.regptr->mlc_addr = (((blockpage->block_num << 5) &
                    0xE0) | (blockpage->page_num & 0x1F));

      /* Page Address 2nd */
      mlcdat.regptr->mlc_addr = (((blockpage->block_num << 5) >>
                    8) & _BITMASK(8));

      if (mlcdat.paramptr->addr_cycles == ADDR_CYCLES_4)
      {
        /* Page Address 3rd */
        mlcdat.regptr->mlc_addr = (((blockpage->block_num << 5)
                    >> 16) & _BITMASK(8));
      }

      /* ECC Auto Decode */
      mlcdat.regptr->mlc_autodec_dec = 0;

      /* Wait for MLC NAND controller ready */
      while (!(mlcdat.regptr->mlc_isr & MLC_CNTRLLR_RDY_STS));

      /* Wait for MLC NAND ECC ready */
      while (!(mlcdat.regptr->mlc_isr & MLC_ECC_RDY_STS));

      if ((mlcdat.regptr->mlc_isr & MLC_DECODE_ERR_DETECT_STS) ||
                    (mlcdat.regptr->mlc_isr &
                    MLC_DECODE_FAIL_STS))
      {
        status = _ERROR;
      }

      /* Read SMALL_BLOCK_PAGE_SPARE_AREA_SIZE/4 words from
      				MLC NAND flash buffer register */
      for (idx = 0; idx < (SMALL_BLOCK_PAGE_SPARE_AREA_SIZE / 4);
           idx++)
      {
        *dwptr++ = (UNS_32)mlcdat.regptr->mlc_buff[0];
      }
    }
    else if (mlcdat.paramptr->block_page == BLOCK_PAGE_LARGE)
    {
      /* Wait for MLC NAND ready */
      while (!(mlcdat.regptr->mlc_isr & MLC_DEV_RDY_STS));

      /* Read mode (3) command */
      mlcdat.regptr->mlc_cmd = NAND_CMD_READ3;

      /* Column Address 1st */
      mlcdat.regptr->mlc_addr = 0;

      /* Column Address 2nd */
      mlcdat.regptr->mlc_addr = 0;

      /* Page Address 1st */
      mlcdat.regptr->mlc_addr = (((blockpage->block_num << 6)
                    & 0xC0) | (blockpage->page_num & 0x3F));

      /* Page Address 2nd */
      mlcdat.regptr->mlc_addr = (((blockpage->block_num << 6)
                    >> 8) & _BITMASK(8));

      if (mlcdat.paramptr->addr_cycles == ADDR_CYCLES_5)
      {
        /* Page Address 3rd */
        mlcdat.regptr->mlc_addr = (((blockpage->block_num <<
                    6) >> 16) & _BITMASK(8));
      }

      /* Read start command */
      mlcdat.regptr->mlc_cmd = NAND_CMD_READSTART;

      for (idy = 0; idy < 4; idy++)
      {
        /* ECC Auto Decode */
        mlcdat.regptr->mlc_autodec_dec = 0;

        /* Wait for MLC NAND controller ready */
        while (!(mlcdat.regptr->mlc_isr & MLC_CNTRLLR_RDY_STS));

        /* Wait for MLC NAND ECC ready */
        while (!(mlcdat.regptr->mlc_isr & MLC_ECC_RDY_STS));

        if ((mlcdat.regptr->mlc_isr &
                    MLC_DECODE_ERR_DETECT_STS) ||
                    (mlcdat.regptr->mlc_isr &
                    MLC_DECODE_FAIL_STS))
        {
          status = _ERROR;
        }

        /* Read (LARGE_BLOCK_PAGE_SPARE_AREA_SIZE/4)/4 words
        			from MLC NAND flash buffer register */
        for (idx = 0; idx <
                    ((LARGE_BLOCK_PAGE_SPARE_AREA_SIZE / 4) / 4);
                    idx++)
        {
          *dwptr++ = (UNS_32)mlcdat.regptr->mlc_buff[0];
        }
      }
    }
  }

  return status;
}

/***********************************************************************
 *
 * Function: mlcnand_read_page
 *
 * Purpose: Read MLC NAND flash page
 *
 * Processing:
 *     If init is not TRUE, then return _ERROR as mlc was not
 *     previously opened. Otherwise, read MLC NAND flash page.
 *
 * Parameters:
 *     devid: Pointer to MLC NAND controller config structure
 *     blockpage: Pointer to MLC_BLOCKPAGE_T structure
 *
 * Outputs: None
 *
 * Returns: The status of read page operation
 *
 * Notes:
 *     Read both MLC NAND flash page main area and spare area.
 *     Small page -
 *      ------------------------------------------
 *     |    512 bytes main   |   16 bytes spare   |
 *      ------------------------------------------
 *     Large page -
 *      ------------------------------------------
 *     |    512 bytes main   |   16 bytes spare   |
 *      ------------------------------------------
 *      ------------------------------------------
 *     |    512 bytes main   |   16 bytes spare   |
 *      ------------------------------------------
 *      ------------------------------------------
 *     |    512 bytes main   |   16 bytes spare   |
 *      ------------------------------------------
 *      ------------------------------------------
 *     |    512 bytes main   |   16 bytes spare   |
 *      ------------------------------------------
 *
 **********************************************************************/
STATUS mlcnand_read_page(INT_32 devid, MLC_BLOCKPAGE_T *blockpage)
{
  STATUS status = _ERROR;
  UNS_32 *dwptr;
  int idx, idy;

  if (mlcdat.init == TRUE)
  {
    status = _NO_ERROR;

    if (mlcdat.paramptr->block_page == BLOCK_PAGE_SMALL)
    {
      if (blockpage->dma != 0)
      {
        /* Wait for MLC NAND ready */
        while (!(mlcdat.regptr->mlc_isr & MLC_DEV_RDY_STS));

        /* Read mode (1) command */
        mlcdat.regptr->mlc_cmd = NAND_CMD_READ1;

