sobczyk/bsp/csps/lpc32xx/source/lpc32xx_mlcnand_driver.c
        /* Column Address */
        mlcdat.regptr->mlc_addr = 0;

        /* Page Address 1st */
        mlcdat.regptr->mlc_addr = (
                    ((blockpage->block_num << 5) &
                    0xE0) | (blockpage->page_num & 0x1F));

        /* Page Address 2nd */
        mlcdat.regptr->mlc_addr = (
                    ((blockpage->block_num << 5) >>
                    8) & _BITMASK(8));

        if (mlcdat.paramptr->addr_cycles == ADDR_CYCLES_4)
        {
          /* Page Address 3rd */
          mlcdat.regptr->mlc_addr = (
                    ((blockpage->block_num << 5)
                    >> 16) & _BITMASK(8));
        }

        /* Clear Interrupt Status */
        while ((mlcdat.regptr->mlc_irq_sr & (MLC_INT_DEV_RDY |
                    MLC_INT_CNTRLLR_RDY | MLC_INT_DECODE_FAIL |
                    MLC_INT_DECODE_ERR | MLC_INT_ENCDEC_RDY)));

        /* Mask Interrupt */
        mlcdat.regptr->mlc_irq_mr = MLC_INT_CNTRLLR_RDY;

        /* Select MLC NAND controller, 
                    disable DMA_REQ signal on NAND_RnB,
                    enable DMA_REQ signal on NAND_INT */
        clkpwr_setup_nand_ctrlr(0, 0, 1);

        dwptr = (UNS_32 *)blockpage->buffer;
        mlcnand_dma_read(devid,
                    (UNS_32)&mlcdat.regptr->mlc_buff[0],
                    (UNS_32)dwptr, blockpage->dma);

        /* ECC Auto Decode */
        mlcdat.regptr->mlc_autodec_dec = 0;

        /* Wait for completion of DMA */
        while (dma_completion == FALSE);

        /* Wait for MLC NAND ECC ready */
        while (!(mlcdat.regptr->mlc_isr & MLC_ECC_RDY_STS));

        if (mlcdat.regptr->mlc_isr &
                    (MLC_DECODE_ERR_DETECT_STS |
                    MLC_DECODE_FAIL_STS))
        {
          status = _ERROR;
        }

        /* release the DMA Channel */
        dma_free_channel(dmach);

        /* Wait for MLC NAND ready */
        while (!(mlcdat.regptr->mlc_isr & MLC_DEV_RDY_STS));

        /* Mask Interrupt */
        mlcdat.regptr->mlc_irq_mr = 0;
      }
      else
      {
        /* Wait for MLC NAND ready */
        while (!(mlcdat.regptr->mlc_isr & MLC_DEV_RDY_STS));

        /* Read mode (1) command */
        mlcdat.regptr->mlc_cmd = NAND_CMD_READ1;

        /* Column Address */
        mlcdat.regptr->mlc_addr = 0;

        /* Page Address 1st */
        mlcdat.regptr->mlc_addr = (
                    ((blockpage->block_num << 5) &
                    0xE0) | (blockpage->page_num & 0x1F));

        /* Page Address 2nd */
        mlcdat.regptr->mlc_addr = (
                    ((blockpage->block_num << 5) >>
                    8) & _BITMASK(8));

        if (mlcdat.paramptr->addr_cycles == ADDR_CYCLES_4)
        {
          /* Page Address 3rd */
          mlcdat.regptr->mlc_addr = (
                    ((blockpage->block_num << 5)
                    >> 16) & _BITMASK(8));
        }

        /* ECC Auto Decode */
        mlcdat.regptr->mlc_autodec_dec = 0;

        /* Wait for MLC NAND controller ready */
        while (!(mlcdat.regptr->mlc_isr & MLC_CNTRLLR_RDY_STS));

        /* Wait for MLC NAND ECC ready */
        while (!(mlcdat.regptr->mlc_isr & MLC_ECC_RDY_STS));

        if (mlcdat.regptr->mlc_isr &
                    (MLC_DECODE_ERR_DETECT_STS |
                    MLC_DECODE_FAIL_STS))
        {
          status = _ERROR;
        }

        /* Read SMALL_BLOCK_PAGE_SIZE/4 words from
        			MLC NAND flash buffer register */
        dwptr = (UNS_32 *)blockpage->buffer;
        for (idx = 0; idx < SMALL_BLOCK_PAGE_SIZE / 4; idx++)
        {
          *dwptr++ = (UNS_32)mlcdat.regptr->mlc_buff[0];
        }
      }
    }
    else if (mlcdat.paramptr->block_page == BLOCK_PAGE_LARGE)
    {
      if (blockpage->dma != 0)
      {
        /* Wait for MLC NAND ready */
        while (!(mlcdat.regptr->mlc_isr & MLC_DEV_RDY_STS));

        /* Read mode (1) command */
        mlcdat.regptr->mlc_cmd = NAND_CMD_READ1;

        /* Column Address 1st */
        mlcdat.regptr->mlc_addr = 0;

        /* Column Address 2nd */
        mlcdat.regptr->mlc_addr = 0;

        /* Page Address 1st */
        mlcdat.regptr->mlc_addr = (((blockpage->block_num << 6)
                    & 0xC0) | (blockpage->page_num & 0x3F));

        /* Page Address 2nd */
        mlcdat.regptr->mlc_addr = (((blockpage->block_num << 6)
                    >> 8) & _BITMASK(8));

        if (mlcdat.paramptr->addr_cycles == ADDR_CYCLES_5)
        {
          /* Page Address 3rd */
          mlcdat.regptr->mlc_addr = (((blockpage->block_num <<
                    6) >> 16) & _BITMASK(8));
        }

        /* Read start command */
        mlcdat.regptr->mlc_cmd = NAND_CMD_READSTART;

        for (idy = 0; idy < 4; idy++)
        {
          /* Clear Interrupt Status */
          while ((mlcdat.regptr->mlc_irq_sr &
                    (MLC_INT_DEV_RDY |
                    MLC_INT_CNTRLLR_RDY | MLC_INT_DECODE_FAIL |
                    MLC_INT_DECODE_ERR | MLC_INT_ENCDEC_RDY)));

          /* Mask Interrupt */
          mlcdat.regptr->mlc_irq_mr = MLC_INT_CNTRLLR_RDY;

        /* Select MLC NAND controller, 
                    disable DMA_REQ signal on NAND_RnB,
                    enable DMA_REQ signal on NAND_INT */
          clkpwr_setup_nand_ctrlr(0, 0, 1);

          dwptr = (UNS_32 *)(blockpage->buffer +
                    (LARGE_BLOCK_PAGE_SIZE / 4) * idy);
          mlcnand_dma_read(devid,
                    (UNS_32)&mlcdat.regptr->mlc_buff[0],
                    (UNS_32)dwptr, blockpage->dma);

          /* ECC Auto Decode */
          mlcdat.regptr->mlc_autodec_dec = 0;

          /* Wait for completion of DMA */
          while (dma_completion == FALSE);

          /* Wait for MLC NAND ECC ready */
          while (!(mlcdat.regptr->mlc_isr & MLC_ECC_RDY_STS));

          if (mlcdat.regptr->mlc_isr &
                    (MLC_DECODE_ERR_DETECT_STS |
                    MLC_DECODE_FAIL_STS))
          {
            status = _ERROR;
          }

          /* release the DMA Channel */
          dma_free_channel(dmach);
        }

