sobczyk/bsp/csps/lpc32xx/source/lpc32xx_mlcnand_driver.c
        /* Wait for MLC NAND ready */
        while (!(mlcdat.regptr->mlc_isr & MLC_DEV_RDY_STS));

        /* Mask Interrupt */
        mlcdat.regptr->mlc_irq_mr = 0;
      }
      else
      {
        /* Wait for MLC NAND ready */
        while (!(mlcdat.regptr->mlc_isr & MLC_DEV_RDY_STS));

        /* Read mode (1) command */
        mlcdat.regptr->mlc_cmd = NAND_CMD_READ1;

        /* Column Address 1st */
        mlcdat.regptr->mlc_addr = 0;

        /* Column Address 2nd */
        mlcdat.regptr->mlc_addr = 0;

        /* Page Address 1st */
        mlcdat.regptr->mlc_addr = (((blockpage->block_num << 6)
                    & 0xC0) | (blockpage->page_num & 0x3F));

        /* Page Address 2nd */
        mlcdat.regptr->mlc_addr = (((blockpage->block_num << 6)
                    >> 8) & _BITMASK(8));

        if (mlcdat.paramptr->addr_cycles == ADDR_CYCLES_5)
        {
          /* Page Address 3rd */
          mlcdat.regptr->mlc_addr = (((blockpage->block_num <<
                    6) >> 16) & _BITMASK(8));
        }

        /* Read start command */
        mlcdat.regptr->mlc_cmd = NAND_CMD_READSTART;

        for (idy = 0; idy < 4; idy++)
        {
          /* ECC Auto Decode */
          mlcdat.regptr->mlc_autodec_dec = 0;

          /* Wait for MLC NAND controller ready */
          while (!(mlcdat.regptr->mlc_isr &
                    MLC_CNTRLLR_RDY_STS));

          /* Wait for MLC NAND ECC ready */
          while (!(mlcdat.regptr->mlc_isr & MLC_ECC_RDY_STS));

          if (mlcdat.regptr->mlc_isr &
                    (MLC_DECODE_ERR_DETECT_STS |
                    MLC_DECODE_FAIL_STS))
          {
            status = _ERROR;
          }

          /* Read (LARGE_BLOCK_PAGE_SIZE/4)/4 words from
          		MLC NAND flash buffer register */
          dwptr = (UNS_32 *)(blockpage->buffer +
                    (LARGE_BLOCK_PAGE_SIZE / 4) * idy);
          for (idx = 0; idx < ((LARGE_BLOCK_PAGE_SIZE / 4) / 4);
                    idx++)
          {
            *dwptr++ = (UNS_32)mlcdat.regptr->mlc_buff[0];
          }
        }
      }
    }
  }

  return status;
}

/***********************************************************************
 *
 * Function: mlcnand_write_page
 *
 * Purpose: Write MLC NAND flash page
 *
 * Processing:
 *     If init is not TRUE, then return _ERROR as mlc was not
 *     previously opened. Otherwise, write MLC NAND flash page.
 *
 * Parameters:
 *     devid: Pointer to MLC NAND controller config structure
 *     blockpage: Pointer to MLC_BLOCKPAGE_T structure
 *
 * Outputs: None
 *
 * Returns: The status of write page operation
 *
 * Notes:
 *     Write both MLC NAND flash page main area and spare area.
 *     Small page -
 *      ------------------------------------------
 *     |    512 bytes main   |   16 bytes spare   |
 *      ------------------------------------------
 *     Large page -
 *      ------------------------------------------
 *     |    512 bytes main   |   16 bytes spare   |
 *      ------------------------------------------
 *      ------------------------------------------
 *     |    512 bytes main   |   16 bytes spare   |
 *      ------------------------------------------
 *      ------------------------------------------
 *     |    512 bytes main   |   16 bytes spare   |
 *      ------------------------------------------
 *      ------------------------------------------
 *     |    512 bytes main   |   16 bytes spare   |
 *      ------------------------------------------
 *
 **********************************************************************/
STATUS mlcnand_write_page(INT_32 devid, MLC_BLOCKPAGE_T *blockpage)
{
  STATUS status = _ERROR;
  UNS_32 *dwptr;
  int idx, idy;

  if (mlcdat.init == TRUE)
  {
    status = _NO_ERROR;

    if (mlcdat.paramptr->block_page == BLOCK_PAGE_SMALL)
    {
      if (blockpage->dma != 0)
      {
        /* Wait for MLC NAND ready */
        while (!(mlcdat.regptr->mlc_isr & MLC_DEV_RDY_STS));

        /* Serial data input command */
        mlcdat.regptr->mlc_cmd = NAND_CMD_SDIN;

        /* Column Address */
        mlcdat.regptr->mlc_addr = 0;

        /* Page Address 1st */
        mlcdat.regptr->mlc_addr = (
                    ((blockpage->block_num << 5) &
                    0xE0) | (blockpage->page_num & 0x1F));

        /* Page Address 2nd */
        mlcdat.regptr->mlc_addr = (
                    ((blockpage->block_num << 5) >>
                    8) & _BITMASK(8));

        if (mlcdat.paramptr->addr_cycles == ADDR_CYCLES_4)
        {
          /* Page Address 3rd */
          mlcdat.regptr->mlc_addr = (
                    ((blockpage->block_num << 5)
                    >> 16) & _BITMASK(8));
        }

        /* ECC Encode */
        mlcdat.regptr->mlc_enc_ecc = 0;

        dwptr = (UNS_32 *)blockpage->buffer;
        mlcnand_dma_write(devid, (UNS_32)dwptr,
                    (UNS_32)&mlcdat.regptr->mlc_buff[0],
                    blockpage->dma);

        /* Wait for completion of DMA */
        while (dma_completion == FALSE);

        /* ECC Auto Encode */
        mlcdat.regptr->mlc_autoenc_enc = 0;

        /* Wait for MLC NAND controller ready */
        while (!(mlcdat.regptr->mlc_isr & MLC_CNTRLLR_RDY_STS));

        /* release the DMA Channel */
        dma_free_channel(dmach);

        /* Auto program command */
        mlcdat.regptr->mlc_cmd = NAND_CMD_PAGEPROG;

        /* Wait for MLC NAND ready */
        while (!(mlcdat.regptr->mlc_isr & MLC_DEV_RDY_STS));
      }
      else
      {
        /* Wait for MLC NAND ready */
        while (!(mlcdat.regptr->mlc_isr & MLC_DEV_RDY_STS));

        /* Serial data input command */
        mlcdat.regptr->mlc_cmd = NAND_CMD_SDIN;

        /* Column Address */
        mlcdat.regptr->mlc_addr = 0;

        /* Page Address 1st */
        mlcdat.regptr->mlc_addr = (
                    ((blockpage->block_num << 5) &
                    0xE0) | (blockpage->page_num & 0x1F));

