sobczyk/bsp/csps/lpc32xx/source/lpc32xx_mlcnand_driver.c
        /* Page Address 2nd */
        mlcdat.regptr->mlc_addr = (
                    ((blockpage->block_num << 5) >>
                    8) & _BITMASK(8));

        if (mlcdat.paramptr->addr_cycles == ADDR_CYCLES_4)
        {
          /* Page Address 3rd */
          mlcdat.regptr->mlc_addr = (
                    ((blockpage->block_num << 5)
                    >> 16) & _BITMASK(8));
        }

        /* ECC Encode */
        mlcdat.regptr->mlc_enc_ecc = 0;

        /* Write SMALL_BLOCK_PAGE_MAIN_AREA_SIZE/4 words to
        			MLC NAND flash buffer register */
        dwptr = (UNS_32 *)blockpage->buffer;
        for (idx = 0; idx < (SMALL_BLOCK_PAGE_MAIN_AREA_SIZE / 4);
                    idx++)
        {
          mlcdat.regptr->mlc_buff[0] = *dwptr++;
        }

        /* Write 1 word to MLC NAND flash buffer register */
        mlcdat.regptr->mlc_buff[0] = *dwptr++;

        /* Write 1 halfword to MLC NAND flash buffer register */
        *(volatile UNS_16 *)&mlcdat.regptr->mlc_buff[0] =
                    *(UNS_16 *)dwptr++;

        /* ECC Auto Encode */
        mlcdat.regptr->mlc_autoenc_enc = 0;

        /* Wait for MLC NAND controller ready */
        while (!(mlcdat.regptr->mlc_isr & MLC_CNTRLLR_RDY_STS));

        /* Auto program command */
        mlcdat.regptr->mlc_cmd = NAND_CMD_PAGEPROG;

        /* Wait for MLC NAND ready */
        while (!(mlcdat.regptr->mlc_isr & MLC_DEV_RDY_STS));
      }
    }
    else if (mlcdat.paramptr->block_page == BLOCK_PAGE_LARGE)
    {
      if (blockpage->dma != 0)
      {
        /* Wait for MLC NAND ready */
        while (!(mlcdat.regptr->mlc_isr & MLC_DEV_RDY_STS));

        /* Serial data input command */
        mlcdat.regptr->mlc_cmd = NAND_CMD_SDIN;

        /* Column Address 1st */
        mlcdat.regptr->mlc_addr = 0;

        /* Column Address 2nd */
        mlcdat.regptr->mlc_addr = 0;

        /* Page Address 1st */
        mlcdat.regptr->mlc_addr = (((blockpage->block_num << 6)
                    & 0xC0) | (blockpage->page_num & 0x3F));

        /* Page Address 2nd */
        mlcdat.regptr->mlc_addr = (((blockpage->block_num << 6)
                    >> 8) & _BITMASK(8));

        if (mlcdat.paramptr->addr_cycles == ADDR_CYCLES_5)
        {
          /* Page Address 3rd */
          mlcdat.regptr->mlc_addr = (((blockpage->block_num <<
                    6) >> 16) & _BITMASK(8));
        }

        for (idy = 0; idy < 4; idy++)
        {
          /* ECC Encode */
          mlcdat.regptr->mlc_enc_ecc = 0;

          dwptr = (UNS_32 *)(blockpage->buffer +
                    (LARGE_BLOCK_PAGE_SIZE / 4) * idy);
          mlcnand_dma_write(devid, (UNS_32)dwptr,
                    (UNS_32)&mlcdat.regptr->mlc_buff[0],
                    blockpage->dma);

          /* Wait for completion of DMA */
          while (dma_completion == FALSE);

          /* ECC Auto Encode */
          mlcdat.regptr->mlc_autoenc_enc = 0;

          /* Wait for MLC NAND controller ready */
          while (!(mlcdat.regptr->mlc_isr & MLC_CNTRLLR_RDY_STS));

          /* release the DMA Channel */
          dma_free_channel(dmach);
        }

        /* Auto program command */
        mlcdat.regptr->mlc_cmd = NAND_CMD_PAGEPROG;

        /* Wait for MLC NAND ready */
        while (!(mlcdat.regptr->mlc_isr & MLC_DEV_RDY_STS));
      }
      else
      {
        /* Wait for MLC NAND ready */
        while (!(mlcdat.regptr->mlc_isr & MLC_DEV_RDY_STS));

        /* Serial data input command */
        mlcdat.regptr->mlc_cmd = NAND_CMD_SDIN;

        /* Column Address 1st */
        mlcdat.regptr->mlc_addr = 0;

        /* Column Address 2nd */
        mlcdat.regptr->mlc_addr = 0;

        /* Page Address 1st */
        mlcdat.regptr->mlc_addr = (((blockpage->block_num << 6)
                    & 0xC0) | (blockpage->page_num & 0x3F));

        /* Page Address 2nd */
        mlcdat.regptr->mlc_addr = (((blockpage->block_num << 6)
                    >> 8) & _BITMASK(8));

        if (mlcdat.paramptr->addr_cycles == ADDR_CYCLES_5)
        {
          /* Page Address 3rd */
          mlcdat.regptr->mlc_addr = (((blockpage->block_num <<
                    6) >> 16) & _BITMASK(8));
        }

        for (idy = 0; idy < 4; idy++)
        {
          /* ECC Encode */
          mlcdat.regptr->mlc_enc_ecc = 0;

          /* Write (LARGE_BLOCK_PAGE_MAIN_AREA_SIZE/4)/4 words
          		to MLC NAND flash buffer register */
          dwptr = (UNS_32 *)(blockpage->buffer +
                    (LARGE_BLOCK_PAGE_SIZE / 4) * idy);
          for (idx = 0; idx <
                    ((LARGE_BLOCK_PAGE_MAIN_AREA_SIZE / 4) / 4);
                    idx++)
          {
            mlcdat.regptr->mlc_buff[0] = *dwptr++;
          }

          /* Write 1 word to MLC NAND flash buffer register */
          mlcdat.regptr->mlc_buff[0] = *dwptr++;

          /* Write 1 halfword to MLC NAND flash buffer register */
          *(volatile UNS_16 *)&mlcdat.regptr->mlc_buff[0] =
                    *(UNS_16 *)dwptr++;

          /* ECC Auto Encode */
          mlcdat.regptr->mlc_autoenc_enc = 0;

          /* Wait for MLC NAND controller ready */
          while (!(mlcdat.regptr->mlc_isr & MLC_CNTRLLR_RDY_STS));
        }

        /* Auto program command */
        mlcdat.regptr->mlc_cmd = NAND_CMD_PAGEPROG;

        /* Wait for MLC NAND ready */
        while (!(mlcdat.regptr->mlc_isr & MLC_DEV_RDY_STS));
      }
    }
  }

  return status;
}

/***********************************************************************
 * MLC NAND controller driver public functions
 **********************************************************************/

/***********************************************************************
 *
 * Function: mlcnand_open
 *
 * Purpose: Open the MLC NAND controller
 *
 * Processing:
 *     See function.
 *
 * Parameters:
 *     ipbase: Pointer to a MLC NAND controller peripheral block
 *     arg   : Not used
 *
 * Outputs: None
 *
 * Returns: The pointer to a MLC NAND controller config structure or
 *          NULL
 *
 * Notes: None
 *
 **********************************************************************/
INT_32 mlcnand_open(void *ipbase, INT_32 arg)
{
  INT_32 status = 0;

