sobczyk/bsp/csps/lpc32xx/source/lpc32xx_mlcnand_driver.c
  if ((MLCNAND_REGS_T *) ipbase == MLCNAND)
  {
    /* Has MLC NAND driver been previously initialized? */
    if (mlcdat.init == FALSE)
    {
      /* Device not initialized and it usable, so set it to
      used */
      mlcdat.init = TRUE;

      /* Save address of register block */
      mlcdat.regptr = MLCNAND;

      /* Save address of NAND flash parameters */
      mlcdat.paramptr = (NANDFLASH_PARAM_T *) arg;

      if (mlcdat.paramptr->bus_width == BUS_WIDTH_8)
      {
        /* Select MLC NAND controller, 
                    disable DMA_REQ signal on NAND_RnB,
                    disable DMA_REQ signal on NAND_INT */
        clkpwr_setup_nand_ctrlr(0, 0, 0);

        /* Enable MLC NAND clock */
        clkpwr_clk_en_dis(CLKPWR_NAND_MLC_CLK, 1);

        /* normal nCE */
        mlcdat.regptr->mlc_ceh = MLC_NORMAL_NCE;

        /* Mask Interrupts */
        mlcdat.regptr->mlc_irq_mr = 0;

        /* Unlock the access to mlc_icr */
        mlcdat.regptr->mlc_lock_pr = 0xA25E;

        /* MLC NAND controller configuration */
        if (mlcdat.paramptr->block_page == BLOCK_PAGE_SMALL)
        {
          if (mlcdat.paramptr->addr_cycles == ADDR_CYCLES_3)
          {
            mlcdat.regptr->mlc_icr = 0;
          }
          else if (mlcdat.paramptr->addr_cycles ==
                    ADDR_CYCLES_4)
          {
            mlcdat.regptr->mlc_icr = MLC_ADDR4_ENABLE;
          }

        }
        else if (mlcdat.paramptr->block_page ==
                    BLOCK_PAGE_LARGE)
        {
          if (mlcdat.paramptr->addr_cycles == ADDR_CYCLES_4)
          {
            mlcdat.regptr->mlc_icr = MLC_LARGE_BLK_ENABLE;
          }
          else if (mlcdat.paramptr->addr_cycles ==
                    ADDR_CYCLES_5)
          {

            mlcdat.regptr->mlc_icr = MLC_LARGE_BLK_ENABLE |
                                     MLC_ADDR4_ENABLE;
          }

        }

        /* Unlock the access to mlc_time */
        mlcdat.regptr->mlc_lock_pr = 0xA25E;

        /* Start with default timings */
        mlcdat.regptr->mlc_time = (MLC_LOAD_TWP(7) |
                    MLC_LOAD_TWH(0) |
                    MLC_LOAD_TRP(0) |
                    MLC_LOAD_TREH(0) |
                    MLC_LOAD_TRHZ(0) |
                    MLC_LOAD_TWBTRB(0) |
                    MLC_LOAD_TCEA(0));

        /* Reset MLC NAND Flash */
        mlcdat.regptr->mlc_cmd = NAND_CMD_RESET;

        /* Wait for MLC NAND ready */
        while (!(mlcdat.regptr->mlc_isr & MLC_DEV_RDY_STS));

        /* Install MLC NAND controller interrupt handler as a
        			IRQ interrupts */
        int_install_irq_handler(IRQ_FLASH,
                    (PFV) mlcnand_interrupt);

        /* Enable MLC NAND interrupt in the interrupt
        			controller */
        int_enable(IRQ_FLASH);

        /* Return pointer to MLC NAND controller
        			config structure */
        status = (INT_32) & mlcdat;
      }
    }
  }

  return status;
}

/***********************************************************************
 *
 * Function: mlcnand_close
 *
 * Purpose: Close the MLC NAND controller
 *
 * Processing:
 *     If init is not TRUE, then return _ERROR to the caller as the
 *     device was not previously opened. Otherwise, disable the timers,
 *     set init to FALSE, and return _NO_ERROR to the caller.
 *
 * Parameters:
 *     devid: Pointer to MLC NAND controller config structure
 *
 * Outputs: None
 *
 * Returns: The status of the close operation
 *
 * Notes: None
 *
 **********************************************************************/
STATUS mlcnand_close(INT_32 devid)
{
  STATUS status = _ERROR;

  if ((MLCNAND_CFG_T *) devid == &mlcdat)
  {
    if (mlcdat.init == TRUE)
    {
      /* normal nCE */
      mlcdat.regptr->mlc_ceh = 0;

      /* Unlock the access to mlc_icr */
      mlcdat.regptr->mlc_lock_pr = 0xA25E;

      /* MLC NAND controller configuration */
      mlcdat.regptr->mlc_icr = 0;

      /* Disable MLC NAND clock */
      clkpwr_clk_en_dis(CLKPWR_NAND_MLC_CLK, 0);

      /* Set device as uninitialized */
      mlcdat.init = FALSE;

      /* Successful operation */
      status = _NO_ERROR;
    }
  }

  return status;
}

/***********************************************************************
 *
 * Function: mlcnand_ioctl
 *
 * Purpose: MLC NAND controller configuration block
 *
 * Processing:
 *     This function is a large case block. Based on the passed function
 *     and option values, set or get the appropriate timer parameter.
 *
 * Parameters:
 *     devid: Pointer to MLC NAND controller config structure
 *     cmd:   ioctl command
 *     arg:   ioctl argument
 *
 * Outputs: None
 *
 * Returns: The status of the ioctl operation
 *
 * Notes: None
 *
 **********************************************************************/
STATUS mlcnand_ioctl(INT_32 devid,
                     INT_32 cmd,
                     INT_32 arg)
{
  int idx;
  INT_32 status = _ERROR;

  if ((MLCNAND_CFG_T *) devid == &mlcdat)
  {
    if (mlcdat.init == TRUE)
    {
      status = _NO_ERROR;

      switch (cmd)
      {
        case MLC_SET_TIMING:
          /* Unlock the access to mlc_time */
          mlcdat.regptr->mlc_lock_pr = 0xA25E;

          /* Set timing */
          mlcdat.regptr->mlc_time = (MLC_LOAD_TWP(
                    ((MLC_TIMING_T *) arg)->wr_low) |
                    MLC_LOAD_TWH(
                    ((MLC_TIMING_T *) arg)->wr_high) |
                    MLC_LOAD_TRP(
                    ((MLC_TIMING_T *) arg)->r_low) |
                    MLC_LOAD_TREH(
                    ((MLC_TIMING_T *) arg)->r_high) |
                    MLC_LOAD_TRHZ(
                    ((MLC_TIMING_T *) arg)->nand_ta) |
                    MLC_LOAD_TWBTRB(
                    ((MLC_TIMING_T *) arg)->busy_delay) |
                    MLC_LOAD_TCEA(
                    ((MLC_TIMING_T *) arg)->tcea_delay));
          break;

