sobczyk/bsp/csps/lpc32xx/source/lpc32xx_mlcnand_driver.c
        case MLC_MASK_INTS:
          /* Mask interrupt */
          mlcdat.regptr->mlc_irq_mr = arg;
          break;

        case MLC_SEND_CMD:
          /* Issue command to MLC NAND Flash */
          for (idx = 0; idx <
                    ((MLC_CMDADR_T *) arg)->num_items; idx++)
          {
            mlcdat.regptr->mlc_cmd =
                    ((MLC_CMDADR_T *) arg)->items[idx];
          }
          break;

        case MLC_SEND_ADDR:
          /* Issue address to MLC NAND Flash */
          for (idx = 0; idx <
                    ((MLC_CMDADR_T *) arg)->num_items; idx++)
          {
            mlcdat.regptr->mlc_addr =
                    ((MLC_CMDADR_T *) arg)->items[idx];
          }
          break;

        case MLC_GET_STATUS:
          /* Get MLC NAND controller status */
          switch (arg)
          {
            case MLC_ST:
              /* Return MLC NAND status */
              status = mlcdat.regptr->mlc_isr;
              break;

            case MLC_INT_ST:
              /* Return MLC NAND interrupt states */
              status = mlcdat.regptr->mlc_irq_sr;
              break;

            default:
              /* Unsupported parameter */
              status = LPC_BAD_PARAMS;
          }
          break;

        case MLC_READ_ID:
          /* Read MLC NAND Flash id */
          status = mlcnand_read_id(devid, (void *) arg);
          break;

        case MLC_ERASE_BLOCK:
          /* Erase MLC NAND Flash block */
          status = mlcnand_erase_block(devid, (UNS_32) arg);
          break;

        case MLC_READ_SPARE:
          /* Read MLC NAND flash spare */
          status = mlcnand_read_spare(devid,
                    (MLC_BLOCKPAGE_T *) arg);
          break;

        case MLC_READ_PAGE:
          /* Read MLC NAND flash page */
          status = mlcnand_read_page(devid,
                    (MLC_BLOCKPAGE_T *) arg);
          break;

        case MLC_WRITE_PAGE:
          /* Write MLC NAND flash page */
          status = mlcnand_write_page(devid,
                    (MLC_BLOCKPAGE_T *) arg);
          break;

        default:
          /* Unsupported parameter */
          status = LPC_BAD_PARAMS;
      }
    }
  }

  return status;
}

/***********************************************************************
 *
 * Function: mlcnand_read
 *
 * Purpose: MLC NAND controller read function (stub only)
 *
 * Processing:
 *     Return 0 to the caller.
 *
 * Parameters:
 *     devid:     Pointer to MLC NAND controller descriptor
 *     buffer:    Pointer to data buffer to copy to
 *     max_bytes: Number of bytes to read
 *
 * Outputs: None
 *
 * Returns: Number of bytes actually read (always 0)
 *
 * Notes: None
 *
 **********************************************************************/
INT_32 mlcnand_read(INT_32 devid,
                    void *buffer,
                    INT_32 max_bytes)
{
  return 0;
}

/***********************************************************************
 *
 * Function: mlcnand_write
 *
 * Purpose: MLC NAND controller write function (stub only)
 *
 * Processing:
 *     Return 0 to the caller.
 *
 * Parameters:
 *     devid:   Pointer to MLC NAND controller descriptor
 *     buffer:  Pointer to data buffer to copy from
 *     n_bytes: Number of bytes to write
 *
 * Outputs: None
 *
 * Returns: Number of bytes actually written (always 0)
 *
 * Notes: None
 *
 **********************************************************************/
INT_32 mlcnand_write(INT_32 devid,
                     void *buffer,
                     INT_32 n_bytes)
{
  return 0;
}
